[{"Text":"If any one wants to discover Verify for contract testing 👇👇","PostedDate":"2024-12-20T20:27:45.471Z"},{"Text":"🤔 Deux projets informatiques, deux approches radicalement différentes...\n\nProjet A : \u0022On code direct, on verra après\u0022\n\nSprint 1 : 5 features développées\nSprint 3 : 4 features développées\nSprint 6 : 2 features développées\nRésultat : La vélocité diminue, on livre de moins en moins car on est freiné par l\u0027architecture actuelle\n\nProjet B : \u0022On prend le temps de comprendre\u0022\n\nSprint 1 : 3 features développées\nSprint 3 : 3 features développées\nSprint 6 : 3 features développées\nRésultat : On anticipe mieux les features car on comprend la vision globale du produit\n\nOn a l\u0027impression qu\u0027en prenant le temps de réfléchir en amont,\nce temps est perdu et qu\u0027il devrait être plutôt utilisé pour coder.\n\nMais l\u0027objectif d\u0027un dev n\u0027est pas d\u0027écrire du code !\nAu contraire, un développeur qui est capable d\u0027enlever du code est bien plus efficace que celui qui en produit à la pelle.\n\nLe temps \u0022perdu\u0022 à comprendre est du temps gagné pour l\u0027avenir.\nPour le client, pour avoir une personne capable de le challenger sur le business (et non pas les détails d\u0027implémentations)\nPour vous, pour éviter de vous épuiser à prendre 4j pour ajouter une feature\n\nOn peut faire le même parallèle avec les tests : \nAu début, on pense que le temps de tests est du temps de développement en moins.\nEt rapidement, on voit que le temps de tests est du temps de débug en moins (donc de développement en plus)\n\nLe développement n\u0027est que la partie visible de l\u0027iceberg.\nLa vraie valeur est dans la compréhension du besoin. 🎯","PostedDate":"2024-12-20T07:30:26.531Z"},{"Text":"Just read this fantastic deep dive into the Ambient Context pattern in .NET! 🚀\n\nhttps://lnkd.in/dVy2CNkv\n\nWhile we all love AsyncLocal and ThreadLocal, they\u0027re just building blocks. This article shows how to level up your context management game with the Ambient Context pattern – perfect for enterprise apps dealing with multi-tenancy, distributed tracing, and cross-cutting concerns.\n\nWhat caught my eye:\n- Solid implementation with stack corruption detection (saved me some headaches!)\n- Real-world examples of correlation IDs and tenant contexts\n- Smart handling of parallel processing scenarios\n- Clean ASP.NET Core integration patterns\n\nBig shoutout for the practical code examples and those \u0022when to use/avoid\u0022 guidelines. Been struggling with context management in our microservices, and this cleared up a lot of questions.\n\nIf you\u0027re building complex .NET apps, especially with async flows, you\u0027ll want to bookmark this one. \n\n#dotnet #softwarearchitecture #microservices #programming\n\nHave a goat day 🐐","PostedDate":"2024-12-19T13:00:26.817Z"},{"Text":"😓 Confession d\u0027un dev qui a passé des années à sur-complexifier ses projets...\n\nJ\u0027étais ce dev qui mettait MediatR partout en .NET.\nPourquoi ? Parce que \u0022c\u0027est ce que font les bons devs\u0022 🤦‍♂️\n\nLa réalité ?\nJe me mentais à moi-même.\n\nJ\u0027ajoutais de la complexité pour me donner l\u0027impression d\u0027être un meilleur développeur.\nC\u0027est une tendance que je vois beaucoup sur LinkedIn : trouver une solution overengineering pour des problèmes simples.\n\nJe viens de publier un article sur GoatReview qui raconte cette prise de conscience.\n\nLa vraie séniorité, ce n\u0027est pas d\u0027empiler les design patterns.\nC\u0027est de savoir quand une simple méthode suffit.\n\nMediatR est un excellent outil... quand on en a VRAIMENT besoin et qu’on comprend les limites.\n\nLe reste du temps ? KISS (Keep It Simple, Stupid) 😉\n\n➡️ Découvre l\u0027article complet en commentaire","PostedDate":"2024-12-16T07:24:08.056Z"},{"Text":"🚀 Tu penses que développer vite fait de toi un bon développeur ?\nDésolé de te décevoir, mais tu fais fausse route...\n\nLe vrai challenge n\u0027est pas de coder vite, c\u0027est de coder juste.\n(J\u0027ai fait exprès de ne pas dire \u0022bien\u0022)\n\nJ\u0027ai vu des projets partir en vrille parce qu\u0027on voulait \u0022avancer vite\u0022...\nDes centaines de lignes de code produites pour finalement tout refaire car on n\u0027avait pas compris le besoin.\n\nLa vérité ? \nLe développement n\u0027est que la dernière étape.\n\nUn développeur qui passe 3 jours à comprendre le métier sans coder est plus productif que celui qui code pendant 3 jours sans comprendre.\n\nLe code n\u0027est que le moyen d\u0027atteindre un objectif, pas l\u0027objectif lui-même.\n\nLa définition du besoin est tellement sous estimé que les développeurs ne prennent même plus le temps de concevoir avant d\u0027implémenter.\n\nCe n\u0027est pas une lacune de prendre le temps de réfléchir, et encore moins pour comprendre le besoin !\n\nN\u0027aie pas peur de répondre à un client :\n\u0022Non, je n\u0027ai pas encore codé, je suis encore en train de comprendre le besoin, et c\u0027est parfait comme ça !\u0022 💪","PostedDate":"2024-12-12T08:16:35.932Z"},{"Text":"Yesterday was about fixing a bug and then apply the \u0022Boy Scout Rule\u0022: \u0022Leave your code better than you found it.\u0022\n\n- What do you think about this rule?\n- What would be different if every developers use this rule continuously?\n\n#sharingiscaring #craft","PostedDate":"2024-12-11T12:46:38.134Z"}]